app/controllers/activities_controller.rb

  def index
    if user_signed_in?
      @activities = Activity.where(:user_id => current_user.id)
---
SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = ?  [["user_id", 1]]

  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("name", "user_id", "created_at", "updated_at", "duration") VALUES (?, ?, ?, ?, ?)  [["name", "Cycling"], ["user_id", 1], ["created_at", "2020-03-20 13:44:32.176174"], ["updated_at", "2020-03-20 13:44:32.176174"], ["duration", "00:15"]]

  def update
    respond_to do |format|
      if @activity.update(activity_params)
---
UPDATE "activities" SET "time" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["time", "2000-01-01 19:00:00"], ["updated_at", "2020-03-20 16:55:02.383814"], ["id", 4]]