app/views/activities/show.html.erb

<div class="user mt-4">
    <p class="text-white pl-3 text-center">By <span class="font-weight-bold user-name"><%= @activity.user.first_name %> <%= @activity.user.last_name %></span></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]